fonecmid-diplom/src/Documents/ВКМ_НачисленияФиксированнойПремии/ВКМ_НачисленияФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>DefinedType.ВКМ_Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачисленияФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		ДвижениеДопНачисления = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеДопНачисления.Сторно = Ложь;
		ДвижениеДопНачисления.ПериодРегистрации = Дата;
		ДвижениеДопНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФексированаяПремия;
		ДвижениеДопНачисления.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеДопНачисления.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии;
		
		ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержание.Сторно = Ложь;
		ДвижениеУдержание.ПериодРегистрации = Дата;
		ДвижениеУдержание.ПериодДействияКонец =НачалоМесяца(Дата);
		ДвижениеУдержание.ПериодДействияКонец = КонецГода(Дата);
		ДвижениеУдержание.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеУдержание.БазовыйПериодКонец = КонецМесяца(Дата);
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержаниеНДФЛ;
		ДвижениеУдержание.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеУдержание.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии * 13/100;
		
	    Движение= Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии  - ДвижениеУдержание.Сумма;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#КонецЕсли
